{
  "token_to_id": {
    "PAD": 0,
    "BOS": 1,
    "EOS": 2,
    "BAR": 3,
    "TS:1": 4,
    "UNK": 5,
    "BPM:149": 6,
    "BPM:153": 7,
    "BPM:166": 8,
    "BPM:172": 9,
    "BPM:175": 10,
    "BPM:182": 11,
    "BPM:183": 12,
    "BPM:185": 13,
    "BPM:187": 14,
    "BPM:189": 15,
    "BPM:191": 16,
    "BPM:192": 17,
    "BPM:193": 18,
    "BPM:194": 19,
    "BPM:195": 20,
    "BPM:196": 21,
    "BPM:197": 22,
    "BPM:198": 23,
    "BPM:199": 24,
    "BPM:200": 25,
    "BPM:201": 26,
    "BPM:202": 27,
    "BPM:203": 28,
    "BPM:204": 29,
    "BPM:205": 30,
    "BPM:206": 31,
    "BPM:207": 32,
    "BPM:208": 33,
    "BPM:209": 34,
    "BPM:210": 35,
    "BPM:211": 36,
    "BPM:212": 37,
    "BPM:213": 38,
    "BPM:214": 39,
    "BPM:215": 40,
    "BPM:216": 41,
    "BPM:218": 42,
    "BPM:219": 43,
    "BPM:220": 44,
    "DRUM:CRASH": 45,
    "DRUM:HHC": 46,
    "DRUM:HHO": 47,
    "DRUM:KICK": 48,
    "DRUM:PERC": 49,
    "DRUM:RIDE": 50,
    "DRUM:SNARE": 51,
    "DRUM:TOM": 52,
    "DUR:1": 53,
    "DUR:10": 54,
    "DUR:100": 55,
    "DUR:102": 56,
    "DUR:103": 57,
    "DUR:105": 58,
    "DUR:106": 59,
    "DUR:107": 60,
    "DUR:108": 61,
    "DUR:109": 62,
    "DUR:11": 63,
    "DUR:110": 64,
    "DUR:111": 65,
    "DUR:113": 66,
    "DUR:114": 67,
    "DUR:115": 68,
    "DUR:116": 69,
    "DUR:117": 70,
    "DUR:118": 71,
    "DUR:119": 72,
    "DUR:12": 73,
    "DUR:121": 74,
    "DUR:123": 75,
    "DUR:124": 76,
    "DUR:126": 77,
    "DUR:128": 78,
    "DUR:13": 79,
    "DUR:130": 80,
    "DUR:14": 81,
    "DUR:141": 82,
    "DUR:143": 83,
    "DUR:15": 84,
    "DUR:154": 85,
    "DUR:155": 86,
    "DUR:16": 87,
    "DUR:160": 88,
    "DUR:162": 89,
    "DUR:164": 90,
    "DUR:168": 91,
    "DUR:17": 92,
    "DUR:171": 93,
    "DUR:174": 94,
    "DUR:175": 95,
    "DUR:176": 96,
    "DUR:18": 97,
    "DUR:184": 98,
    "DUR:19": 99,
    "DUR:2": 100,
    "DUR:20": 101,
    "DUR:206": 102,
    "DUR:207": 103,
    "DUR:21": 104,
    "DUR:22": 105,
    "DUR:222": 106,
    "DUR:226": 107,
    "DUR:23": 108,
    "DUR:24": 109,
    "DUR:25": 110,
    "DUR:26": 111,
    "DUR:27": 112,
    "DUR:28": 113,
    "DUR:29": 114,
    "DUR:3": 115,
    "DUR:30": 116,
    "DUR:31": 117,
    "DUR:32": 118,
    "DUR:33": 119,
    "DUR:34": 120,
    "DUR:35": 121,
    "DUR:36": 122,
    "DUR:37": 123,
    "DUR:38": 124,
    "DUR:39": 125,
    "DUR:4": 126,
    "DUR:40": 127,
    "DUR:41": 128,
    "DUR:42": 129,
    "DUR:43": 130,
    "DUR:44": 131,
    "DUR:45": 132,
    "DUR:46": 133,
    "DUR:47": 134,
    "DUR:48": 135,
    "DUR:49": 136,
    "DUR:5": 137,
    "DUR:50": 138,
    "DUR:51": 139,
    "DUR:52": 140,
    "DUR:53": 141,
    "DUR:54": 142,
    "DUR:55": 143,
    "DUR:56": 144,
    "DUR:57": 145,
    "DUR:58": 146,
    "DUR:59": 147,
    "DUR:6": 148,
    "DUR:60": 149,
    "DUR:61": 150,
    "DUR:62": 151,
    "DUR:63": 152,
    "DUR:64": 153,
    "DUR:65": 154,
    "DUR:66": 155,
    "DUR:67": 156,
    "DUR:68": 157,
    "DUR:69": 158,
    "DUR:7": 159,
    "DUR:70": 160,
    "DUR:71": 161,
    "DUR:72": 162,
    "DUR:73": 163,
    "DUR:74": 164,
    "DUR:75": 165,
    "DUR:77": 166,
    "DUR:78": 167,
    "DUR:79": 168,
    "DUR:8": 169,
    "DUR:80": 170,
    "DUR:81": 171,
    "DUR:82": 172,
    "DUR:83": 173,
    "DUR:84": 174,
    "DUR:85": 175,
    "DUR:86": 176,
    "DUR:88": 177,
    "DUR:89": 178,
    "DUR:9": 179,
    "DUR:91": 180,
    "DUR:92": 181,
    "DUR:93": 182,
    "DUR:94": 183,
    "DUR:96": 184,
    "DUR:97": 185,
    "DUR:98": 186,
    "DUR:99": 187,
    "KEY:C_major": 188,
    "NOTE:100": 189,
    "NOTE:101": 190,
    "NOTE:102": 191,
    "NOTE:103": 192,
    "NOTE:104": 193,
    "NOTE:105": 194,
    "NOTE:107": 195,
    "NOTE:21": 196,
    "NOTE:22": 197,
    "NOTE:23": 198,
    "NOTE:24": 199,
    "NOTE:25": 200,
    "NOTE:26": 201,
    "NOTE:27": 202,
    "NOTE:28": 203,
    "NOTE:29": 204,
    "NOTE:30": 205,
    "NOTE:31": 206,
    "NOTE:32": 207,
    "NOTE:33": 208,
    "NOTE:34": 209,
    "NOTE:35": 210,
    "NOTE:36": 211,
    "NOTE:37": 212,
    "NOTE:38": 213,
    "NOTE:39": 214,
    "NOTE:40": 215,
    "NOTE:41": 216,
    "NOTE:42": 217,
    "NOTE:43": 218,
    "NOTE:44": 219,
    "NOTE:45": 220,
    "NOTE:46": 221,
    "NOTE:47": 222,
    "NOTE:48": 223,
    "NOTE:49": 224,
    "NOTE:50": 225,
    "NOTE:51": 226,
    "NOTE:52": 227,
    "NOTE:53": 228,
    "NOTE:54": 229,
    "NOTE:55": 230,
    "NOTE:56": 231,
    "NOTE:57": 232,
    "NOTE:58": 233,
    "NOTE:59": 234,
    "NOTE:60": 235,
    "NOTE:61": 236,
    "NOTE:62": 237,
    "NOTE:63": 238,
    "NOTE:64": 239,
    "NOTE:65": 240,
    "NOTE:66": 241,
    "NOTE:67": 242,
    "NOTE:68": 243,
    "NOTE:69": 244,
    "NOTE:70": 245,
    "NOTE:71": 246,
    "NOTE:72": 247,
    "NOTE:73": 248,
    "NOTE:74": 249,
    "NOTE:75": 250,
    "NOTE:76": 251,
    "NOTE:77": 252,
    "NOTE:78": 253,
    "NOTE:79": 254,
    "NOTE:80": 255,
    "NOTE:81": 256,
    "NOTE:82": 257,
    "NOTE:83": 258,
    "NOTE:84": 259,
    "NOTE:85": 260,
    "NOTE:86": 261,
    "NOTE:87": 262,
    "NOTE:88": 263,
    "NOTE:89": 264,
    "NOTE:90": 265,
    "NOTE:91": 266,
    "NOTE:92": 267,
    "NOTE:93": 268,
    "NOTE:94": 269,
    "NOTE:95": 270,
    "NOTE:96": 271,
    "NOTE:97": 272,
    "NOTE:98": 273,
    "NOTE:99": 274
  },
  "id_to_token": {
    "0": "PAD",
    "1": "BOS",
    "2": "EOS",
    "3": "BAR",
    "4": "TS:1",
    "5": "UNK",
    "6": "BPM:149",
    "7": "BPM:153",
    "8": "BPM:166",
    "9": "BPM:172",
    "10": "BPM:175",
    "11": "BPM:182",
    "12": "BPM:183",
    "13": "BPM:185",
    "14": "BPM:187",
    "15": "BPM:189",
    "16": "BPM:191",
    "17": "BPM:192",
    "18": "BPM:193",
    "19": "BPM:194",
    "20": "BPM:195",
    "21": "BPM:196",
    "22": "BPM:197",
    "23": "BPM:198",
    "24": "BPM:199",
    "25": "BPM:200",
    "26": "BPM:201",
    "27": "BPM:202",
    "28": "BPM:203",
    "29": "BPM:204",
    "30": "BPM:205",
    "31": "BPM:206",
    "32": "BPM:207",
    "33": "BPM:208",
    "34": "BPM:209",
    "35": "BPM:210",
    "36": "BPM:211",
    "37": "BPM:212",
    "38": "BPM:213",
    "39": "BPM:214",
    "40": "BPM:215",
    "41": "BPM:216",
    "42": "BPM:218",
    "43": "BPM:219",
    "44": "BPM:220",
    "45": "DRUM:CRASH",
    "46": "DRUM:HHC",
    "47": "DRUM:HHO",
    "48": "DRUM:KICK",
    "49": "DRUM:PERC",
    "50": "DRUM:RIDE",
    "51": "DRUM:SNARE",
    "52": "DRUM:TOM",
    "53": "DUR:1",
    "54": "DUR:10",
    "55": "DUR:100",
    "56": "DUR:102",
    "57": "DUR:103",
    "58": "DUR:105",
    "59": "DUR:106",
    "60": "DUR:107",
    "61": "DUR:108",
    "62": "DUR:109",
    "63": "DUR:11",
    "64": "DUR:110",
    "65": "DUR:111",
    "66": "DUR:113",
    "67": "DUR:114",
    "68": "DUR:115",
    "69": "DUR:116",
    "70": "DUR:117",
    "71": "DUR:118",
    "72": "DUR:119",
    "73": "DUR:12",
    "74": "DUR:121",
    "75": "DUR:123",
    "76": "DUR:124",
    "77": "DUR:126",
    "78": "DUR:128",
    "79": "DUR:13",
    "80": "DUR:130",
    "81": "DUR:14",
    "82": "DUR:141",
    "83": "DUR:143",
    "84": "DUR:15",
    "85": "DUR:154",
    "86": "DUR:155",
    "87": "DUR:16",
    "88": "DUR:160",
    "89": "DUR:162",
    "90": "DUR:164",
    "91": "DUR:168",
    "92": "DUR:17",
    "93": "DUR:171",
    "94": "DUR:174",
    "95": "DUR:175",
    "96": "DUR:176",
    "97": "DUR:18",
    "98": "DUR:184",
    "99": "DUR:19",
    "100": "DUR:2",
    "101": "DUR:20",
    "102": "DUR:206",
    "103": "DUR:207",
    "104": "DUR:21",
    "105": "DUR:22",
    "106": "DUR:222",
    "107": "DUR:226",
    "108": "DUR:23",
    "109": "DUR:24",
    "110": "DUR:25",
    "111": "DUR:26",
    "112": "DUR:27",
    "113": "DUR:28",
    "114": "DUR:29",
    "115": "DUR:3",
    "116": "DUR:30",
    "117": "DUR:31",
    "118": "DUR:32",
    "119": "DUR:33",
    "120": "DUR:34",
    "121": "DUR:35",
    "122": "DUR:36",
    "123": "DUR:37",
    "124": "DUR:38",
    "125": "DUR:39",
    "126": "DUR:4",
    "127": "DUR:40",
    "128": "DUR:41",
    "129": "DUR:42",
    "130": "DUR:43",
    "131": "DUR:44",
    "132": "DUR:45",
    "133": "DUR:46",
    "134": "DUR:47",
    "135": "DUR:48",
    "136": "DUR:49",
    "137": "DUR:5",
    "138": "DUR:50",
    "139": "DUR:51",
    "140": "DUR:52",
    "141": "DUR:53",
    "142": "DUR:54",
    "143": "DUR:55",
    "144": "DUR:56",
    "145": "DUR:57",
    "146": "DUR:58",
    "147": "DUR:59",
    "148": "DUR:6",
    "149": "DUR:60",
    "150": "DUR:61",
    "151": "DUR:62",
    "152": "DUR:63",
    "153": "DUR:64",
    "154": "DUR:65",
    "155": "DUR:66",
    "156": "DUR:67",
    "157": "DUR:68",
    "158": "DUR:69",
    "159": "DUR:7",
    "160": "DUR:70",
    "161": "DUR:71",
    "162": "DUR:72",
    "163": "DUR:73",
    "164": "DUR:74",
    "165": "DUR:75",
    "166": "DUR:77",
    "167": "DUR:78",
    "168": "DUR:79",
    "169": "DUR:8",
    "170": "DUR:80",
    "171": "DUR:81",
    "172": "DUR:82",
    "173": "DUR:83",
    "174": "DUR:84",
    "175": "DUR:85",
    "176": "DUR:86",
    "177": "DUR:88",
    "178": "DUR:89",
    "179": "DUR:9",
    "180": "DUR:91",
    "181": "DUR:92",
    "182": "DUR:93",
    "183": "DUR:94",
    "184": "DUR:96",
    "185": "DUR:97",
    "186": "DUR:98",
    "187": "DUR:99",
    "188": "KEY:C_major",
    "189": "NOTE:100",
    "190": "NOTE:101",
    "191": "NOTE:102",
    "192": "NOTE:103",
    "193": "NOTE:104",
    "194": "NOTE:105",
    "195": "NOTE:107",
    "196": "NOTE:21",
    "197": "NOTE:22",
    "198": "NOTE:23",
    "199": "NOTE:24",
    "200": "NOTE:25",
    "201": "NOTE:26",
    "202": "NOTE:27",
    "203": "NOTE:28",
    "204": "NOTE:29",
    "205": "NOTE:30",
    "206": "NOTE:31",
    "207": "NOTE:32",
    "208": "NOTE:33",
    "209": "NOTE:34",
    "210": "NOTE:35",
    "211": "NOTE:36",
    "212": "NOTE:37",
    "213": "NOTE:38",
    "214": "NOTE:39",
    "215": "NOTE:40",
    "216": "NOTE:41",
    "217": "NOTE:42",
    "218": "NOTE:43",
    "219": "NOTE:44",
    "220": "NOTE:45",
    "221": "NOTE:46",
    "222": "NOTE:47",
    "223": "NOTE:48",
    "224": "NOTE:49",
    "225": "NOTE:50",
    "226": "NOTE:51",
    "227": "NOTE:52",
    "228": "NOTE:53",
    "229": "NOTE:54",
    "230": "NOTE:55",
    "231": "NOTE:56",
    "232": "NOTE:57",
    "233": "NOTE:58",
    "234": "NOTE:59",
    "235": "NOTE:60",
    "236": "NOTE:61",
    "237": "NOTE:62",
    "238": "NOTE:63",
    "239": "NOTE:64",
    "240": "NOTE:65",
    "241": "NOTE:66",
    "242": "NOTE:67",
    "243": "NOTE:68",
    "244": "NOTE:69",
    "245": "NOTE:70",
    "246": "NOTE:71",
    "247": "NOTE:72",
    "248": "NOTE:73",
    "249": "NOTE:74",
    "250": "NOTE:75",
    "251": "NOTE:76",
    "252": "NOTE:77",
    "253": "NOTE:78",
    "254": "NOTE:79",
    "255": "NOTE:80",
    "256": "NOTE:81",
    "257": "NOTE:82",
    "258": "NOTE:83",
    "259": "NOTE:84",
    "260": "NOTE:85",
    "261": "NOTE:86",
    "262": "NOTE:87",
    "263": "NOTE:88",
    "264": "NOTE:89",
    "265": "NOTE:90",
    "266": "NOTE:91",
    "267": "NOTE:92",
    "268": "NOTE:93",
    "269": "NOTE:94",
    "270": "NOTE:95",
    "271": "NOTE:96",
    "272": "NOTE:97",
    "273": "NOTE:98",
    "274": "NOTE:99"
  },
  "size": 275
}